chore(readme): convert graph to mermaid
